In [ ]:
# Leetcode 184: https://leetcode.com/problems/department-highest-salary/description/

In [1]:
import pandas as pd

In [3]:
data_employee = {
    "id": [1, 2, 3, 4, 5],
    "name": ["Joe", "Jim", "Henry", "Sam", "Max"],
    "salary": [70000, 90000, 80000, 60000, 90000],
    "departmentId": [1, 1, 2, 2, 1]
}
employee = pd.DataFrame(data_employee)

data_department = {
    "id": [1, 2],
    "name": ["IT", "Sales"]
}
department = pd.DataFrame(data_department)

print("Employee DataFrame:")
print(employee)
print("\nDepartment DataFrame:")
print(department)

Employee DataFrame:
   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

Department DataFrame:
   id   name
0   1     IT
1   2  Sales

In [33]:
df = employee.merge(department, left_on='departmentId', right_on='id', how='left')
df

   id_x name_x  salary  departmentId  id_y name_y
0     1    Joe   70000             1     1     IT
1     2    Jim   90000             1     1     IT
2     3  Henry   80000             2     2  Sales
3     4    Sam   60000             2     2  Sales
4     5    Max   90000             1     1     IT

In [34]:
df.rename(columns={'name_x': 'Employee', 'name_y': 'Department', 'salary': 'Salary'}, inplace=True)
df

   id_x Employee  Salary  departmentId  id_y Department
0     1      Joe   70000             1     1         IT
1     2      Jim   90000             1     1         IT
2     3    Henry   80000             2     2      Sales
3     4      Sam   60000             2     2      Sales
4     5      Max   90000             1     1         IT

In [20]:
# Similar to the window function in SQL
max_salary = df.groupby('Department')['Salary'].transform('max')
max_salary

0    90000
1    90000
2    80000
3    80000
4    90000
Name: Salary, dtype: int64

In [21]:
# This would be an aggregation within each group
max_salary2 = df.groupby('Department')['Salary'].max()
max_salary2

Department
IT       90000
Sales    80000
Name: Salary, dtype: int64

In [22]:
# Sorting changes index order
sorted_max_salary = max_salary.sort_values()
sorted_max_salary

2    80000
3    80000
0    90000
1    90000
4    90000
Name: Salary, dtype: int64

In [29]:
# Wrong comparison
sorted_max_salary=sorted_max_salary.reset_index(drop=True)
df[df['Salary'] == sorted_max_salary]

   id_x Employee  Salary  departmentId  id_y Department
4     5      Max   90000             1     1         IT

In [11]:
# Comparison with the correct indices/labels
df = df[df['Salary'] == max_salary]
df

   id_x Employee  Salary  departmentId  id_y Department
1     2      Jim   90000             1     1         IT
2     3    Henry   80000             2     2      Sales
4     5      Max   90000             1     1         IT

In [12]:
df[['Department', 'Employee', 'Salary']]

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000

In [35]:
comparison = df['Salary'] == max_salary

In [41]:
result = df[comparison][['Department', 'Employee', 'Salary']]
result

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000

In [43]:
'Department' in result

True

In [44]:
result['Department']

1       IT
2    Sales
4       IT
Name: Department, dtype: object

In [46]:
result.isnull()

   Department  Employee  Salary
1       False     False   False
2       False     False   False
4       False     False   False